Revit 2027 API
LinearArray.GetCopiedMemberIds Method
Retrieves the copied member ids from the array. The first item in an array contains the original elements from which the array was created. All other items in the array are copies.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public override ICollection<ElementId> GetCopiedMemberIds()
Public Overrides Function GetCopiedMemberIds As ICollection(Of ElementId)
public:
virtual ICollection<ElementId^>^ GetCopiedMemberIds() override
abstract GetCopiedMemberIds : unit -> ICollection<ElementId>
override GetCopiedMemberIds : unit -> ICollection<ElementId>
Return Value
ICollection<ElementId>
The copied member ids of the Array
Remarks
Note that in the family environment, arrays of count 0 or 1 use a placeholder item for the first copied item. The member ids from the placeholder item are returned too.
See Also
Reference
LinearArray Class
Autodesk.Revit.DB Namespace